services/load-tests/load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://tzpefz4ue5.execute-api.us-east-1.amazonaws.com
  processor: "./metrics.js"
  phases:
    - duration: 60
      arrivalCount: 10
      name: Warm up phase
    - duration: 60
      arrivalCount: 100
      name: Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 1
      name: Spike phase
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
  payload:
    path: "api-keys.csv"
    fields:
      - api_key
scenarios:
  - afterResponse: "trackCacheMisses"
    flow:
      - loop:
          - get:
              url: "v1/api/hello"
              headers:
                Authorization: "Bearer {{ api_key }}"
        count: 100